app/controllers/rooms_controller.rb

  def create
    @room = Room.new(room_params)    # 不是最终的实现方式
    if @room.save
---
INSERT INTO "rooms" ("rommid", "build", "size", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["rommid", "j123"], ["build", "hunt"], ["size", 12], ["created_at", 2016-09-10 04:18:52 UTC], ["updated_at", 2016-09-10 04:18:52 UTC]]

  def edit
    @room = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @room = Room.find_by_id(params[:id])
      if @room.update_attributes(room_params)
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "rooms" SET "status" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["status", true], ["updated_at", 2016-09-11 16:25:35 UTC], ["id", 1]]

  def index
    @rooms = Room.paginate(page: params[:page])
---
SELECT  "rooms".* FROM "rooms" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "rooms"